================================================================================
Comment With Arbitrary Text
================================================================================

0x0000000000400510     80 3d 1d 0b 20 00 00    cmpb   $0x0,0x200b1d(%rip)        # Unconventional stuff

--------------------------------------------------------------------------------

(source
  (source_location
    (address)
    (machine_code_bytes
      (byte)
      (byte)
      (byte)
      (byte)
      (byte)
      (byte)
      (byte))
    (instruction)
    (comment)))


================================================================================
Comment With Hexadecimal 1
================================================================================

0x00000000004005f1      4c 8d 25 e8 07 20 00    lea    0x2007e8(%rip),%r12        # 0x600de0

--------------------------------------------------------------------------------

(source
  (source_location
    (address)
    (machine_code_bytes
      (byte)
      (byte)
      (byte)
      (byte)
      (byte)
      (byte)
      (byte))
    (instruction)
    (comment
      (hexadecimal))))


================================================================================
Comment With Hexadecimal 2
================================================================================

0x0000000000400510     80 3d 1d 0b 20 00 00    cmpb   $0x0,0x200b1d(%rip)        # 0x601034 <completed.6355>

--------------------------------------------------------------------------------

(source
  (source_location
    (address)
    (machine_code_bytes
      (byte)
      (byte)
      (byte)
      (byte)
      (byte)
      (byte)
      (byte))
    (instruction)
    (comment
      (hexadecimal)
      (code_location
        (identifier)))))


================================================================================
Comment With Number 1
================================================================================

462b12:       4c 8b 2d b7 74 25 00    mov    0x2574b7(%rip),%r13        # 6b9fd0 <iconv_open@plt+0x2b7330>

--------------------------------------------------------------------------------

(source
  (source_location
    (address)
    (machine_code_bytes
      (byte)
      (byte)
      (byte)
      (byte)
      (byte)
      (byte)
      (byte))
    (instruction)
    (comment
      (hexadecimal)
      (code_location
        (identifier)
        (hexadecimal)))))


================================================================================
Comment With Number 2
================================================================================

462b12:       4c 8b 2d b7 74 25 00    mov    0x2574b7(%rip),%r13         # 6b9fd0

--------------------------------------------------------------------------------

(source
  (address)
  (machine_code_bytes
    (byte)
    (byte)
    (byte)
    (byte)
    (byte)
    (byte)
    (byte))
  (instruction)
  (comment
    (hexadecimal)))


================================================================================
Comment With ; And Text
================================================================================

462b12:       4c 8b 2d b7 74 25 00    mov    0x2574b7(%rip),%r13         ; something

--------------------------------------------------------------------------------

(source
  (address)
  (machine_code_bytes
    (byte)
    (byte)
    (byte)
    (byte)
    (byte)
    (byte)
    (byte))
  (instruction)
  (comment))


================================================================================
Comment With ; And Number
================================================================================

462b12:       4c 8b 2d b7 74 25 00    mov    0x2574b7(%rip),%r13         ; 6b9fd0

--------------------------------------------------------------------------------

(source
  (address)
  (machine_code_bytes
    (byte)
    (byte)
    (byte)
    (byte)
    (byte)
    (byte)
    (byte))
  (instruction)
  (comment
    (hexadecimal)))
